In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("aug_train.csv")

In [3]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [4]:
df.shape

(19158, 14)

In [5]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [7]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
enrollee_id,19158.0,16875.358179,9616.292592,1.000,8554.25,16982.500,25169.75,33380.000
city_development_index,19158.0,0.828848,0.123362,0.448,0.74,0.903,0.92,0.949
training_hours,19158.0,65.366896,60.058462,1.000,23.00,47.000,88.00,336.000
target,19158.0,0.249348,0.432647,0.000,0.00,0.000,0.00,1.000

In [15]:
df['enrollee_id'].dtype

dtype('int64')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [29]:
for i in df.columns:
    if df[i].dtype == 'O':
        print(i,' ---> ',df[i].nunique())

city  --->  123
gender  --->  3
relevent_experience  --->  2
enrolled_university  --->  3
education_level  --->  5
major_discipline  --->  6
experience  --->  22
company_size  --->  8
company_type  --->  6
last_new_job  --->  6

In [31]:
for i in df.columns:
    if (df[i].dtype == 'O' and df[i].nunique()<10):
        print(i,':')
        print(df[i].value_counts())
        print()

gender :
Male      13221
Female     1238
Other       191
Name: gender, dtype: int64

relevent_experience :
Has relevent experience    13792
No relevent experience      5366
Name: relevent_experience, dtype: int64

enrolled_university :
no_enrollment       13817
Full time course     3757
Part time course     1198
Name: enrolled_university, dtype: int64

education_level :
Graduate          11598
Masters            4361
High School        2017
Phd                 414
Primary School      308
Name: education_level, dtype: int64

major_discipline :
STEM               14492
Humanities           669
Other                381
Business Degree      327
Arts                 253
No Major             223
Name: major_discipline, dtype: int64

company_size :
50-99        3083
100-500      2571
10000+       2019
10/49        1471
1000-4999    1328
<10          1308
500-999       877
5000-9999     563
Name: company_size, dtype: int64

company_type :
Pvt Ltd                9817
Funded Startup         1001
Public Sector           955
Early Stage Startup     603
NGO                     521
Other                   121
Name: company_type, dtype: int64

last_new_job :
1        8040
>4       3290
2        2900
never    2452
4        1029
3        1024
Name: last_new_job, dtype: int64

In [37]:
for i in df.columns:
    if (df[i].dtype == 'O' and df[i].nunique()<10):
        print(i,'=   ',[df[i].unique()])

gender =    [array(['Male', nan, 'Female', 'Other'], dtype=object)]
relevent_experience =    [array(['Has relevent experience', 'No relevent experience'], dtype=object)]
enrolled_university =    [array(['no_enrollment', 'Full time course', nan, 'Part time course'],
      dtype=object)]
education_level =    [array(['Graduate', 'Masters', 'High School', nan, 'Phd', 'Primary School'],
      dtype=object)]
major_discipline =    [array(['STEM', 'Business Degree', nan, 'Arts', 'Humanities', 'No Major',
       'Other'], dtype=object)]
company_size =    [array([nan, '50-99', '<10', '10000+', '5000-9999', '1000-4999', '10/49',
       '100-500', '500-999'], dtype=object)]
company_type =    [array([nan, 'Pvt Ltd', 'Funded Startup', 'Early Stage Startup', 'Other',
       'Public Sector', 'NGO'], dtype=object)]
last_new_job =    [array(['1', '>4', 'never', '4', '3', '2', nan], dtype=object)]

In [ ]:
relevent_experience_categories = ['No relevent experience', 'Has relevent experience']
enrolled_university =    ['no_enrollment', 'Part time course', 'Full time course']
education_level_categories = ['Primary School', 'High School', 'Graduate', 'Masters','Phd']